<template>
  <v-content>
    <div class="block">
      <v-container>
        <h2 class="text-center">จากในน้องๆทีมงาน</h2>
        <v-row>
          <v-col
            v-for="item in items"
            :key="item.id"
            class="d-flex child-flex"
            cols="12"
            sm="4"
          >
            <v-card flat tile class="mx-auto">
              <v-img
                :src="item.src"
                aspect-ratio="1"
                class="grey lighten-2"
              ></v-img>
              <v-card-text class="text--primary text-center">
                <div class="title">{{ item.name }}</div>
                <p>{{ item.title }}</p>
              </v-card-text>
            </v-card>
          </v-col>
        </v-row>
      </v-container>
    </div>
  </v-content>
</template>

<script>
export default {
  name: "About",
  data() {
    return {
      items: [
        {
          id: 1,
          src: require("../assets/images/team1.jpg"),
          name: "นาคินทร์ ชูมณี",
          title:
            "ใจนึงก็ใจหายครับพี่ อีกใจก็ดีใจกับพี่ด้วยครับที่ได้ย้ายไปอยู่ใกล้ครอบครัวครับ พี่จะได้ไม่เหนื่อยในการเดินทางมาก ขอให้พี่โชคดี มีความสุข ประสบแต่สิ่งดีๆครับ",
        },
        {
          id: 2,
          src: require("../assets/images/team2.jpg"),
          name: "กิตติพงษ์ นาคสังข์",
          title:
            "ผมก็ภูมิใจครับ หลาย ๆ สิ่งหลาย ๆ อย่างที่เราได้ร่วมสร้างกันมา อาจจะถูกใจพี่บ้างหรือไม่ถูกใจพี่บ้างผมก็ขอโทษพี่ด้วยครับ แต่ผมก็ดีใจที่ทุกคนได้ร่วมกันทำจนสำเร็จ หลังจากนี้ไปผมขอให้พี่มีความสุขมาก ๆ จากกันแค่กาย ความผูกพันยังเหมือนเดิมครับ ด้วยความเคารพที่สุดครับ",
        },
        {
          id: 3,
          src: require("../assets/images/team3.jpg"),
          name: "พงศกร อุ่นแก้ว",
          title:
            "ยินดีด้วยครับพี่ ผมขอบคุณพี่นูน ที่ดูแลน้องในศูนย์ฯมาตลอด ไว้มีโอกาสได้เจอกันอีกครับพี่ อาจจะมีที่ไม่ถูกใจหรือ เห็นไม่ตรงกันบ้าง แต่รักและเคารพพี่เสมอครับ",
        },
        {
          id: 4,
          src: require("../assets/images/team4.jpg"),
          name: "สิทธิชัย สังข์แก้ว",
          title:
            "ดีใจด้วยมากๆครับพี่นูน ได้กลับทำงานใกล้ครอบครัวแล้ว ทำงานเสร็จกลับบ้าน กินข้าวกับครวบครัว ผมว่ามันเป็นสิ่งที่มีความสุขมากๆ ขอขอบคุณพี่นูนมากๆ ที่ค่อยดูแล ค่อยอบรม ค่อยช่วยเหลือ พวกเรามาตลอด(ใจหายเหมือนกันนะพี่) แต่ในสุดแล้วตรงนั้นมันพร ที่พี่ขอไว้  ดีใจด้วยมากๆครับ ขอให้พี่นูนมีความสุข มีความสมหวังในหน้าที่การงานและมาความสุขกับครอบครัวมากๆนะครับ อย่าลืมพวกลืมพวกผมนะ อยากกินทุเรียนอร่อยๆ บอกผมได้นะเดียวจัดให้",
        },
        {
          id: 5,
          src: require("../assets/images/team5.jpg"),
          name: "ธนฤทธิ์ ทิพรัตน์",
          title:
            "ถึงแม้มีเวลาสั้นๆที่ได้ร่วมงานกับพี่นูน..ผมก็มีความรู้สึกภาคภูมิใจมากๆเช่นกันที่ได้ร่วมงานกับพื่นูนและได้เป็นส่วนหนึ่งของทีมชุมพรครับ..ขอให้พี่นูนมีความสุขสมหวังในหน้าที่การงานและครอบครัวนะครับ..ปล.อย่าลืมน้องๆที่ชุมพรนะครับทุกๆคนเป็นน้องพี่นูนเสมอครับพี่",
        },
        {
          id: 6,
          src: require("../assets/images/team6.jpg"),
          name: "ศิริพงษ์ ศิริวัฒน์",
          title:
            "พี่ยินดีด้วยนะครับได้กลับไปอยู่ใกล้บ้าน ถึงแม้จะพี่งอยู่ด้วยไม่นาน แต่บ้านหลังนี้ที่มีพี่นูนอยู่ อบอุ่นมากครับพี่",
        },
        {
          id: 7,
          src: require("../assets/images/team5.jpg"),
          name: "สิทธิชัย มากวิสัย",
          title:
            "สุขทุกข์ สมหวัง ผิดหวัง หัวเราะร้องไห้ อุปสรรค ทางเรียบ ทุกคืนวันมีความหมายเสมอมาครับ ขอบคุณโชคชะตา ที่ให้ได้ร่วมงานกันครับพี่ อบอุ่นมากครับ มีอะไรให้ช่วยเหลือ ก็ยินดีเป็นอย่างยิ่งครับพี",
        },
      ],
    };
  },
};
</script>
